## 5장. Pandas 시작하기

In [22]:
import pandas as pd 
import numpy as np

In [3]:
# Series : 1차원 자료구조, index를 가진다. 
obj_1 = pd.Series([4, 7, -3, 5])
obj_1

0    4
1    7
2   -3
3    5
dtype: int64

In [4]:
obj_2 = pd.Series([4, 7, -3, 5], index =['a', 'b', 'c', 'd'] )
obj_2

a    4
b    7
c   -3
d    5
dtype: int64

In [6]:
#dict의 활용 
states_data = {'Califonia':35000, 'Ohio':25000, 'Oregon': 21000, 'Utha': 170000, 'Texas': 90000}
obj_3 = pd.Series(states_data)
obj_3

Califonia     35000
Ohio          25000
Oregon        21000
Utha         170000
Texas         90000
dtype: int64

In [8]:
data_2 = [35000, 25000, 21000, 170000, 90000]
index_2 = ['Califonia', 'Ohio', 'Oregon', 'Utha', 'Texas']
obj_4 = pd.Series(data_2, index=index_2)
obj_4

Califonia     35000
Ohio          25000
Oregon        21000
Utha         170000
Texas         90000
dtype: int64

In [12]:
#data frame 만들기 
data = {'states':['Califonia', 'Ohio', 'Oregon', 'Utha', 'Texas'], 
        'year':[2000, 2001, 2002, 2003, 2004], 
        'pop':[1.5, 1.7, 3.6, 2.4, 2.9]     
}

pd.DataFrame(data)

      states  year  pop
0  Califonia  2000  1.5
1       Ohio  2001  1.7
2     Oregon  2002  3.6
3       Utha  2003  2.4
4      Texas  2004  2.9

In [11]:
pd.DataFrame(data, columns = ['year', 'states', 'pop'] )

   year     states  pop
0  2000  Califonia  1.5
1  2001       Ohio  1.7
2  2002     Oregon  3.6
3  2003       Utha  2.4
4  2004      Texas  2.9

In [19]:
data['debt'] = 16.1
pd.DataFrame(data)

      states  year  pop  debt
0  Califonia  2000  1.5  16.1
1       Ohio  2001  1.7  16.1
2     Oregon  2002  3.6  16.1
3       Utha  2003  2.4  16.1
4      Texas  2004  2.9  16.1

In [34]:
import numpy as np
data['debt_2'] = np.arange(5)
pd.DataFrame(data)

      states  year  pop  debt  debt_2
0  Califonia  2000  1.5  16.1       0
1       Ohio  2001  1.7  16.1       1
2     Oregon  2002  3.6  16.1       2
3       Utha  2003  2.4  16.1       3
4      Texas  2004  2.9  16.1       4

In [2]:
#reindex 
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d','b','a','c' ] )
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [4]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [9]:
obj3= pd.Series(['red', 'blue', 'black'], index = [0, 2, 4])
obj3

0      red
2     blue
4    black
dtype: object

In [15]:
#reindex와 method를 사용하여, 빈 값을 보간 
obj3.reindex(range(10), method = 'ffill')  #forward fill

0      red
1      red
2     blue
3     blue
4    black
5    black
6    black
7    black
8    black
9    black
dtype: object

In [16]:
obj3.reindex(range(10), method = 'bfill')   #back fill

0      red
1     blue
2     blue
3    black
4    black
5      NaN
6      NaN
7      NaN
8      NaN
9      NaN
dtype: object

In [24]:
# DataFrame의 생성과 수정 
data = pd.DataFrame(np.arange(9).reshape((3,3)), index = ['a','c','d'], columns = ['Ohio', 'Texas', 'LA'])
data

   Ohio  Texas  LA
a     0      1   2
c     3      4   5
d     6      7   8

In [25]:
data.reindex(['a','b','c','d'])

   Ohio  Texas   LA
a   0.0    1.0  2.0
b   NaN    NaN  NaN
c   3.0    4.0  5.0
d   6.0    7.0  8.0

In [27]:
states = ['Ohio', 'Texas', 'LA', 'Utha']
data.reindex(columns = states)

   Ohio  Texas  LA  Utha
a     0      1   2   NaN
c     3      4   5   NaN
d     6      7   8   NaN

In [29]:
# 보통은 loc로 간편하게 행/열 이름 변경 
index = ['a','b','c','d']
states = ['Ohio', 'Texas', 'LA', 'Utha']
data.loc[index, states]              #### loc[low, columns]

   Ohio  Texas   LA  Utha
a   0.0    1.0  2.0   NaN
b   NaN    NaN  NaN   NaN
c   3.0    4.0  5.0   NaN
d   6.0    7.0  8.0   NaN

In [31]:
# drop 함수로 행/열 삭제 
data = pd.DataFrame(np.arange(16).reshape((4,4)), 
                   index = ['a','b','c','d'], 
                   columns = ['Ohio', 'Texas', 'LA', 'Utha']
                   )
data

   Ohio  Texas  LA  Utha
a     0      1   2     3
b     4      5   6     7
c     8      9  10    11
d    12     13  14    15

In [40]:
data.drop('LA', axis = 1)   #컬럼을 삭제할때는 axis를 사용 (행 삭제는 axis = 0을 생략가능함 )

   Ohio  Texas  Utha
a     0      1     3
b     4      5     7
c     8      9    11
d    12     13    15

In [42]:
data.drop(['c','d'])

   Ohio  Texas  LA  Utha
a     0      1   2     3
b     4      5   6     7

In [37]:
data.drop(['LA', 'Utha'], axis = 1)   #컬럼을 삭제할때는 axis를 사용 (행 삭제는 axis = 0을 생략가능함 )

   Ohio  Texas
a     0      1
b     4      5
c     8      9
d    12     13

In [50]:
data[['LA', 'Utha']]  # DataFrame에서 특정값만 가져오기

   LA  Utha
a   2     3
b   6     7
c  10    11
d  14    15

In [54]:
data[0:2]   # DataFrame에서 특정값만 가져오기

   Ohio  Texas  LA  Utha
a     0      1   2     3
b     4      5   6     7

In [56]:
data[data['Texas'] > 5]   # DataFrame에서 특정조건에 해당하는 값만 가져오기

   Ohio  Texas  LA  Utha
c     8      9  10    11
d    12     13  14    15

In [62]:
# df를 합산하면, 공통되는 행/열만 합산되고 그렇지 않으면 nan이 된다. 
df1 = pd.DataFrame(np.arange(9).reshape((3,3)), index = ['Ohio', 'Texas', 'Colorado'], columns = list('bcd') )
df2 = pd.DataFrame(np.arange(12).reshape((4,3)), index = ['Utha','Ohio', 'Texas', 'Oregon'], columns = list('bde') )

In [68]:
print (df1, '\n', df2)

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8
         b   d   e
Utha    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [63]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utha      NaN NaN   NaN NaN

In [78]:
f = lambda x : x.max() - x.min()   # 최대값과 최소값의 차를 구하는 함수 생성 
df2.apply(f, axis = 1)     # apply로 df2에 적용

Utha      2
Ohio      2
Texas     2
Oregon    2
dtype: int64

In [79]:
f1 = lambda x : x.sum()
df1.apply(f1, axis = 0)

b     9
c    12
d    15
dtype: int64

In [80]:
f1 = lambda x : x.sum()
df1.apply(f1, axis = 1)

Ohio         3
Texas       12
Colorado    21
dtype: int64

In [82]:
df3 = pd.Series(range(4), index = ['d', 'a', 'b', 'c'])
df3

d    0
a    1
b    2
c    3
dtype: int64

In [84]:
df3.sort_index()   ## index로 정렬하기

a    1
b    2
c    3
d    0
dtype: int64

In [87]:
df3.sort_values()  ## value로 정렬하기

d    0
a    1
b    2
c    3
dtype: int64

In [89]:
df2.sort_values(by='e')  #특정컬럼 기준으로 정렬하기

        b   d   e
Utha    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [93]:
df1.sort_values(by=['c', 'd'], ascending = False)

          b  c  d
Colorado  6  7  8
Texas     3  4  5
Ohio      0  1  2

In [96]:
# rank로 순위구하기 
df4 = pd.Series([7, -5, 4, 7, 2, 0, 3])
print(df4, '\n', df4.rank())

0    7
1   -5
2    4
3    7
4    2
5    0
6    3
dtype: int64
 0    6.5
1    1.0
2    5.0
3    6.5
4    3.0
5    2.0
6    4.0
dtype: float64

### 5.3 기술통계 계산 및 요약

In [98]:
# sum, mean, max, min, median, var, std, cumsum, count, describe, quantile 
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [97]:
df1.sum()

b     9
c    12
d    15
dtype: int64

In [100]:
df1.sum(axis=1)

Ohio         3
Texas       12
Colorado    21
dtype: int64

In [101]:
df1.describe()

         b    c    d
count  3.0  3.0  3.0
mean   3.0  4.0  5.0
std    3.0  3.0  3.0
min    0.0  1.0  2.0
25%    1.5  2.5  3.5
50%    3.0  4.0  5.0
75%    4.5  5.5  6.5
max    6.0  7.0  8.0

In [102]:
df1.cumsum()

          b   c   d
Ohio      0   1   2
Texas     3   5   7
Colorado  9  12  15

In [107]:
# corr, cov
iris = pd.read_csv("D:\edu_dataset\iris.csv")
iris.head()

   caseno  SepalLength  SepalWidth  PetalLength  PetalWidth Species
0       1          5.1         3.5          1.4         0.2  setosa
1       2          4.9         3.0          1.4         0.2  setosa
2       3          4.7         3.2          1.3         0.2  setosa
3       4          4.6         3.1          1.5         0.2  setosa
4       5          5.0         3.6          1.4         0.2  setosa

In [108]:
iris.corr()

               caseno  SepalLength  SepalWidth  PetalLength  PetalWidth
caseno       1.000000     0.716676   -0.402301     0.882637    0.900027
SepalLength  0.716676     1.000000   -0.117570     0.871754    0.817941
SepalWidth  -0.402301    -0.117570    1.000000    -0.428440   -0.366126
PetalLength  0.882637     0.871754   -0.428440     1.000000    0.962865
PetalWidth   0.900027     0.817941   -0.366126     0.962865    1.000000

In [109]:
iris.cov()

                  caseno  SepalLength  SepalWidth  PetalLength  PetalWidth
caseno       1887.500000    25.782886   -7.618121    67.692953   29.805034
SepalLength    25.782886     0.685694   -0.042434     1.274315    0.516271
SepalWidth     -7.618121    -0.042434    0.189979    -0.329656   -0.121639
PetalLength    67.692953     1.274315   -0.329656     3.116278    1.295609
PetalWidth     29.805034     0.516271   -0.121639     1.295609    0.581006